[
  {
    "valid": true,
    "q": "Who is Bragason And Associates?",
    "a": [
      "Bragason And Associates is an Australian Proprietary Limited company that was formed in Sydney Australia, in 1998.",
      "For the last quarter of century the company has had a single employee who is also the director, but associates have always been welcome."
    ]
  },
  {
    "valid": true,
    "q": "Why was Celin.XL developed?",
    "a": [
      "The biggest challenge for an Oracle E1/JDE developer is to keep track of the data flow. And when it comes to making sense of ad-hoc data, you just can't beat Excel.",
      "So, initially the objective was to create a tool that makes it easy to extract data from JDE into Excel."
    ]
  },
  {
    "valid": true,
    "q": "Who uses Celin.XL?",
    "a": [
      "As an Oracle E1/JDE developer, I find it indispensable.",
      "The Microsoft Appshare doesn't give you any install statistics, so the user base consist only of myself as far as I know. The benefit of that of course is that support has been very good!"
    ]
  },
  {
    "valid": true,
    "q": "Why is Celin.XL free?",
    "a": [
      "Users haven't exactly been lining up, so setting up some sort of billing model would be a total waste of time.",
      "But there are plans to make this commercially viable.  More on that later."
    ]
  },
  {
    "valid": true,
    "q": "What is Celin.XL written in?",
    "a": [
      "There are two parts to the Celin.XL development.",
      "1. Interfacing with the Excel API and Task Pane. The native language here is JavaScript and HTML. The development tools are Svelte with TypeScript and Tailwindcss.",
      "2. The core engine that parses queries and scripts into JDE AIS calls is written in C# and runs in as Blazor Web Assembly."
    ]
  },
  {
    "valid": true,
    "q": "Where is Celin.XL hosted?",
    "a": [
      "Celin.XL is a mix of JavaScript and Web Assembly code that runs in Excel's add-ins Web View.",
      "There is only one external dependency, excluding JDE AIS, which is the Office API.",
      "The Celin.XL bundle is hosted on Australia's Oracle Cloud Infrastructure.  Office downloads an instance of its own and only checks the host for new versions.",
      "Celin.XL can be run in the browser with xl.celin.io to try out functions that don't depend on Excel."
    ]
  }
]